# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "neovim"
brew "rbenv"
brew "fzf"
brew "awscli"
brew "gh"
brew "jq"
brew "postgresql"
brew "tree"
brew "ripgrep"
brew "ctags"
brew "htop"
brew "direnv"
brew "git-secrets"
brew "mas"
brew "node" # for neovim
brew "fd"

# cask
cask "raycast"
cask "iterm2"
cask "slack"
cask "deepl"
cask "skim"
cask "postman"
cask "docker"
cask "zoom"
cask "karabiner-elements"
cask "discord"
cask "arc"

# mas
mas "LINE" 539883307
# mas "Save to Pocket" 1477385213
